Reports/ВедомостьАмортизацииОбъектовОСНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ВедомостьАмортизацииОбъектовОСНалоговыйУчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccountingRegisters/Налоговый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Налоговый</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Налоговый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируемыйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/НалоговыеНазначенияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НалоговыеНазначенияОС</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСНалоговыйУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимостьНУ</Name>
					<Comment>Первоначальная стоимость для НУ (на 01.01.2002 или на момент ввода в эксплуатацию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяГруппаОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппыОсновныхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УДАЛИТЬУчитываетсяКакЗапасНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УДАЛИТЬНеУчитываетсяКакОСНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияОСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОСОрганизаций</Name>
			<Comment>(Регл) Регистр, который показывает изменение состояний основных по бух. учету ОС. Данные вносятся только документами. По этому регистру ведется анализ даты принятия к учету, ввода в эксплуатацию, выбытия.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Comment>Дата установки состояния</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ВедомостьАмортизацииОбъектовОСНалоговыйУчет/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Настройка периода
Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	// не выводим общие
	ОбщийОтчет.мСтруктураНевыводимыхГруппировок.Вставить("Общие", 1);

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаНач"              , ОбщийОтчет.ДатаНач);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаКон"              , КонецДня(ОбщийОтчет.ДатаКон));
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СостояниеВвода"       , Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СостояниеСнятияСУчета", Перечисления.СостоянияОС.СнятоСУчета);
	
	МассивСчетов = Новый Массив(3);
	МассивСчетов[0] = ПланыСчетов.Налоговый.ОсновныеСредстваУчетПоОбъектам;
	МассивСчетов[1] = ПланыСчетов.Налоговый.НепроизводственныеОсновныеСредства;
	МассивСчетов[2] = ПланыСчетов.Налоговый.ОсновныеСредстваВыведенныеИзЭксплуатации;
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СчетаУчета", МассивСчетов);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СчетВР",     ПланыСчетов.Налоговый.ВаловыеРасходы); 
	
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Стоимость.Организация                                   КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Организация)                    КАК ОрганизацияПредставление,
	|	Стоимость.Счет                                          КАК СчетУчета,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Счет)                           КАК СчетУчетаПредставление,
	|	Стоимость.Субконто1                                     КАК ВидНалоговойДеятельности,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Субконто1)                      КАК ВидНалоговойДеятельностиПредставление,
	|	Стоимость.Субконто2                                     КАК ОсновноеСредство,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Субконто2)                      КАК ОсновноеСредствоПредставление,
	|	РегСостоянияОС.ДатаВводаВЭксплуатацию                   КАК ДатаВводаВЭксплуатацию,
	|	РегСостоянияОС.ДатаСнятияСУчета                         КАК ДатаСнятияСУчета,
	|	СУММА(ПервоначальныеСведения.ПервоначальнаяСтоимостьНУ) КАК ПервоначальнаяСтоимость,
	|	СУММА(Стоимость.СуммаНачальныйОстаток)                  КАК СтоимостьНачальныйОстаток,
	|	СУММА(Стоимость.СуммаОборотДт)                          КАК СтоимостьОборотДт,
	|	СУММА(Стоимость.СуммаОборотКт)                          КАК СтоимостьСАмортизациейОборотКт,
	|	СУММА(Стоимость.СуммаОборот)                            КАК СтоимостьСАмортизациейОборот,
	|	СУММА(Амортизация.СуммаОборот)                          КАК АмортизацияОборот,
	|	СУММА(Стоимость.СуммаОборотКт) 
	|		- ЕСТЬNULL(СУММА(Амортизация.СуммаОборот), 0)       КАК СтоимостьОборотКт,
	|	СУММА(Стоимость.СуммаОборот) 
	|		- ЕСТЬNULL(СУММА(Амортизация.СуммаОборот), 0)       КАК СтоимостьОборот,
	|	СУММА(Стоимость.СуммаКонечныйОстаток)                   КАК СтоимостьКонечныйОстаток,
	|	ПервоначальныеСведения.НалоговаяГруппаОС                КАК НалоговаяГруппаОС,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведения.НалоговаяГруппаОС) КАК НалоговаяГруппаОСПредставление,
	|	Стоимость.Субконто2.Код                                 КАК КодОС
	|{ВЫБРАТЬ
	|	Стоимость.Организация.*            КАК Организация,
	|	Стоимость.Субконто1                КАК ВидНалоговойДеятельности,
	|	Стоимость.Субконто2                КАК ОсновноеСредство,
	|	Стоимость.Субконто2.Изготовитель   КАК Изготовитель,
	|	Стоимость.Субконто2.НомерПаспорта  КАК НомерПаспорта,
	|	Стоимость.Субконто2.ЗаводскойНомер КАК ЗаводскойНомер,
	|	Стоимость.Субконто2.ДатаВыпуска    КАК ДатаВыпуска,
	|	Стоимость.Субконто2.Модель         КАК Модель,
	|	ДатаВводаВЭксплуатацию             КАК ДатаВводаВЭксплуатацию,
	|	ДатаСнятияСУчета                   КАК ДатаСнятияСУчета,
	|	СчетУчета.*                        КАК СчетУчета,
	|	НалоговаяГруппаОС                  КАК НалоговаяГруппаОС,
	|	Стоимость.Субконто2.Код            КАК КодОС}
	|ИЗ
	|	РегистрБухгалтерии.Налоговый.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , ,
	|	                   Счет В (&СчетаУчета) {Счет КАК СчетУчета}, , 
	|	                   {Субконто2 КАК ОсновноеСредство, Организация.* КАК Организация,
	|	                   Субконто1 КАК ВидНалоговойДеятельности}) КАК Стоимость
	|		ЛЕВОЕ СОЕДИНЕНИЕ (
	|			ВЫБРАТЬ
	|				НалоговыеНазначенияОС.Организация              						КАК Организация,
	|				НалоговыеНазначенияОС.ОсновноеСредство         						КАК ОсновноеСредство,
	|				НалоговыеНазначенияОС.НалоговоеНазначение.ВидНалоговойДеятельности 	КАК ВидНалоговойДеятельности,
	|				ПервоначальныеСведения.НалоговаяГруппаОС           КАК НалоговаяГруппаОС,
	|				ПервоначальныеСведения.ПервоначальнаяСтоимостьНУ   КАК ПервоначальнаяСтоимостьНУ
	|			ИЗ
	|				РегистрСведений.НалоговыеНазначенияОС.СрезПоследних(&ДатаКон,
	|				                {ОсновноеСредство КАК ОсновноеСредство, 
	|				                Организация.* КАК Организация}) КАК НалоговыеНазначенияОС
	|					ЛЕВОЕ СОЕДИНЕНИЕ 
	|						РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(
	|						                &ДатаКон, {ОсновноеСредство КАК ОсновноеСредство,
	|						                Организация.* КАК Организация}) КАК ПервоначальныеСведения
	|					ПО НалоговыеНазначенияОС.Организация = ПервоначальныеСведения.Организация
	|					   И НалоговыеНазначенияОС.ОсновноеСредство = ПервоначальныеСведения.ОсновноеСредство) КАК ПервоначальныеСведения
	|		ПО Стоимость.Организация = ПервоначальныеСведения.Организация
	|			И Стоимость.Субконто1 = ПервоначальныеСведения.ВидНалоговойДеятельности
	|			И Стоимость.Субконто2 = ПервоначальныеСведения.ОсновноеСредство
	|			И Стоимость.Субконто3 = ПервоначальныеСведения.НалоговаяГруппаОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ
	|				СостоянияОС.Организация      КАК Организация,
	|				СостоянияОС.ОсновноеСредство КАК ОсновноеСредство,
	|				МАКСИМУМ(ВЫБОР
	|						 	КОГДА СостоянияОС.Состояние = &СостояниеВвода
	|								ТОГДА СостоянияОС.ДатаСостояния
	|						 	ИНАЧЕ NULL
	|					     КОНЕЦ) КАК ДатаВводаВЭксплуатацию,
	|				МАКСИМУМ(ВЫБОР
	|						 	КОГДА СостоянияОС.Состояние = &СостояниеСнятияСУчета
	|								ТОГДА СостоянияОС.ДатаСостояния
	|						 	ИНАЧЕ NULL
	|					     КОНЕЦ) КАК ДатаСнятияСУчета
	|			ИЗ
	|				РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
	|			{ГДЕ
	|				СостоянияОС.Организация.*,
	|				СостоянияОС.ОсновноеСредство}
	|		
	|			СГРУППИРОВАТЬ ПО
	|				СостоянияОС.Организация,
	|				СостоянияОС.ОсновноеСредство) КАК РегСостоянияОС
	|		ПО Стоимость.Организация = РегСостоянияОС.Организация
	|			И Стоимость.Субконто2 = РегСостоянияОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Налоговый.ОборотыДтКт(&ДатаНач, 
	|			                   &ДатаКон, , СчетДт = &СчетВР, , 
	|			                   СчетКт В (&СчетаУчета) {СчетКт КАК СчетУчета}, ,
	|			                   {СубконтоКт2 КАК ОсновноеСредство, Организация.* КАК Организация}) КАК Амортизация
	|		ПО Стоимость.Организация = Амортизация.Организация
	|			И Стоимость.Субконто1 = Амортизация.СубконтоКт1
	|			И Стоимость.Субконто2 = Амортизация.СубконтоКт2
	|			И Стоимость.Субконто3 = Амортизация.СубконтоКт3
	|{ГДЕ
	|	РегСостоянияОС.ДатаВводаВЭксплуатацию    КАК ДатаВводаВЭксплуатацию,
	|	РегСостоянияОС.ДатаСнятияСУчета          КАК ДатаСнятияСУчета,
	|	ПервоначальныеСведения.НалоговаяГруппаОС КАК НалоговаяГруппаОС}
	|
	|СГРУППИРОВАТЬ ПО
	|	Стоимость.Организация,
	|	Стоимость.Субконто1,
	|	Стоимость.Субконто2,
	|	РегСостоянияОС.ДатаВводаВЭксплуатацию,
	|	РегСостоянияОС.ДатаСнятияСУчета,
	|	Стоимость.Счет,
	|	ПервоначальныеСведения.НалоговаяГруппаОС
	|{УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ВидНалоговойДеятельности,
	|	ОсновноеСредство,
	|	ПервоначальнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьОборотДт,
	|	СтоимостьСАмортизациейОборотКт,
	|	СтоимостьСАмортизациейОборот,
	|	СтоимостьКонечныйОстаток,
	|	АмортизацияОборот,
	|	СтоимостьОборотКт,
	|	СтоимостьОборот,
	|	СчетУчета.*,
	|	НалоговаяГруппаОС.*}
	|ИТОГИ
	|	СУММА(ПервоначальнаяСтоимость),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьОборотДт),
	|	СУММА(СтоимостьСАмортизациейОборотКт),
	|	СУММА(СтоимостьСАмортизациейОборот),
	|	СУММА(АмортизацияОборот),
	|	СУММА(СтоимостьОборотКт),
	|	СУММА(СтоимостьОборот),
	|	СУММА(СтоимостьКонечныйОстаток)
	|ПО
	|	ОБЩИЕ,
	|	Организация,
	|	СчетУчета,
	|	ВидНалоговойДеятельности
	|{ИТОГИ ПО
	|	Организация,
	|	СчетУчета.*,
	|	ВидНалоговойДеятельности,
	|	ОсновноеСредство,
	|	НалоговаяГруппаОС}
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить( "Организация",                    "Организация");
	СтруктураПредставлениеПолей.Вставить( "ОрганизацияГоловнаяОрганизация", НСтр("ru='Головная организация';uk='Головна організація'"));
	СтруктураПредставлениеПолей.Вставить( "ОрганизацияЮрФизЛицо",           НСтр("ru='Юр. / физ. лицо';uk='Юр. / фіз. особа'"));
	СтруктураПредставлениеПолей.Вставить( "ОсновноеСредство",               НСтр("ru='Основное средство';uk='Основний засіб'"));
	СтруктураПредставлениеПолей.Вставить( "Изготовитель",                   НСтр("ru='Изготовитель';uk='Виробник'"));
	СтруктураПредставлениеПолей.Вставить( "НомерПаспорта",                  НСтр("ru='Номер паспорта ОС';uk='Номер паспорта ОЗ'"));
	СтруктураПредставлениеПолей.Вставить( "ЗаводскойНомер",                 НСтр("ru='Заводской номер ОС';uk='Заводський номер ОЗ'"));
	СтруктураПредставлениеПолей.Вставить( "ДатаВыпуска",                    НСтр("ru='Дата выпуска (постройки)';uk='Дата випуску (побудови)'"));
	СтруктураПредставлениеПолей.Вставить( "Модель",                         НСтр("ru='Модель, тип, марка';uk='Модель, тип, марка'"));
	СтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию",         НСтр("ru='Дата ввода в эксплуатацию';uk='Дата введення в експлуатацію'"));
	СтруктураПредставлениеПолей.Вставить( "ДатаСнятияСУчета",         		НСтр("ru='Дата снятия с учета';uk='Дата зняття з обліку'"));
	СтруктураПредставлениеПолей.Вставить( "СчетУчета",         				НСтр("ru='Счет учета';uk='Рахунок'"));
	СтруктураПредставлениеПолей.Вставить( "ВидНалоговойДеятельности",       НСтр("ru='Вид налоговой деятельности';uk='Вид податкової діяльності'"));
	СтруктураПредставлениеПолей.Вставить( "НалоговаяГруппаОС",              НСтр("ru='Налоговая группа';uk='Податкова група'"));
	СтруктураПредставлениеПолей.Вставить( "КодОС",                          НСтр("ru='Код ОС';uk='Код ОЗ'"));
	
	СтруктураПредставлениеПолей.Вставить( "ПервоначальнаяСтоимость",        НСтр("ru='Первоначальная стоимость';uk='Первинна вартість'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток",      НСтр("ru='Стоимость на начало периода';uk='Вартість на початок періоду'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборотДт",              НСтр("ru='Стоимость (приход)';uk='Вартість (надходження)'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьСАмортизациейОборотКт", НСтр("ru='Стоимость с аморт.(расход)';uk='Вартість із аморт.(витрата)'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьСАмортизациейОборот",   НСтр("ru='Изменение стоим. ОС с уч. аморт.';uk='Зміну варт. ОЗ із ур. аморт.'"));
	СтруктураПредставлениеПолей.Вставить( "АмортизацияОборот",              НСтр("ru='Амортизация за период';uk='Амортизація за період'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборотКт",              НСтр("ru='Стоимость (расход)';uk='Вартість (витрата)'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборот",                НСтр("ru='Изменение стоимости';uk='Зміна вартості'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток",       НСтр("ru='Стоимость на конец периода';uk='Вартість на кінець періоду'"));
	
	ПостроительОтчета.Текст = Текст;
		
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	ОбщийОтчет.ЗаполнитьПоказатели( "ПервоначальнаяСтоимость",        НСтр("ru='Первоначальная стоимость';uk='Первинна вартість'"),            Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьНачальныйОстаток",      НСтр("ru='Стоимость на начало периода';uk='Вартість на початок періоду'"),         Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборотДт",              НСтр("ru='Стоимость (приход)';uk='Вартість (надходження)'"),                  Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьСАмортизациейОборотКт", НСтр("ru='Стоимость с аморт.(расход)';uk='Вартість із аморт.(витрата)'"),          Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьСАмортизациейОборот",   НСтр("ru='Изменение стоим. ОС с уч. аморт.';uk='Зміну варт. ОЗ із ур. аморт.'"),    Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияОборот",              НСтр("ru='Амортизация за период';uk='Амортизація за період'"),               Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборотКт",              НСтр("ru='Стоимость (расход)';uk='Вартість (витрата)'"),                  Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборот",                НСтр("ru='Изменение стоимости';uk='Зміна вартості'"),                 Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьКонечныйОстаток",       НСтр("ru='Стоимость на конец периода';uk='Вартість на кінець періоду'"),          Истина, "ЧЦ=15; ЧДЦ=2");
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Организация");
	МассивОтбора.Добавить("ОсновноеСредство");
	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения     = Истина;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;
	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет=Неопределено) Экспорт
	
	// Если отчет, вызвавший процедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры

ОбщийОтчет.ИмяРегистра = "Налоговый";
ОбщийОтчет.мНазваниеОтчета = НСтр("ru='Ведомость амортизации объектов ОС (налоговый учет)';uk=""Відомість амортизації об'єктів ОЗ (податковий облік)""");
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.мРежимВводаПериода = 0;
ОбщийОтчет.мВыбиратьИспользованиеСвойств = Ложь;

#КонецЕсли
